# CannotGenerateAllNecessaryElements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CannotGenerateAllNecessaryElements Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Unable to regenerate all necessary elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGenerateAllNecessaryElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGenerateAllNecessaryElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGenerateAllNecessaryElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace